#+TITLE: Intro to Java Programming
#+AUTHOR: Scott Runnels
#+LANGUAGE: en
#+EXPORT_FILE_NAME: part02b.pdf
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:nil -:nil f:t *:t <:t 
#+BIND: org-latex-caption-above nil
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+COLUMNS: %20ITEM %13BEAMER_env(Env) %6BEAMER_envargs(Args) %4BEAMER_col(Col) %7BEAMER_extra(Extra)
#+BEAMER_THEME: metropolis
# #+BEAMER_OUTER_THEME: miniframes [subsection=false]
#+BEAMER_HEADER: \subtitle{Repeating Functionality}
# #+BEAMER_HEADER: \AtBeginSection[]{
# This line inserts a table of contents with the current section highlighted at
# the beginning of each section
# #+BEAMER_HEADER: \begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}
# In order to have the miniframes/smoothbars navigation bullets even though we do not use subsections 
# q.v. https://tex.stackexchange.com/questions/2072/beamer-navigation-circles-without-subsections/2078#2078
# #+BEAMER_HEADER: \subsection{}
# #+BEAMER_HEADER: }
#+LATEX_HEADER: \definecolor{myblue}{RGB}{20,105,176}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage[listings, many]{tcolorbox}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{etoolbox}
#+LATEX_HEADER: \usepackage{local-style}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{tcolorbox}[enhanced,colframe=myblue,boxrule=1pt,boxsep=1pt,left=1pt,right=1pt,top=-0pt,bottom=0pt,arc=0pt,toprule=0pt, rightrule=0pt,colback=white,attach boxed title to top left={yshift=-0pt},title=Code,boxed title style={colback=myblue, right=0mm, bottomrule=0pt, left=0mm, arc=0pt}, fonttitle=\tiny]}%
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{tcolorbox}}%
#+LATEX_HEADER: \usepackage{parskip}
** Creating a loop to collect numbers                             :B_onlyenv:
   :PROPERTIES:
   :BEAMER_env: onlyenv
   :BEAMER_act: <1>
   :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,autogobble=true,highlightlines={5}
    #+begin_src java :wrap resultscode :exports both
      int[] numbers = new int[]{1,2,3,4,5};
      int index = 0;

      while(index < 5){
          int evens = 0;
          if ( numbers[index] % 2 == 0 ){
              evens = evens + 1;
          }

          System.out.println("Count of even numbers: " + evens);
          index = index + 1;    
      }
    #+end_src

    #+RESULTS:
    #+begin_resultscode
    Count of even numbers: 0
    Count of even numbers: 1
    Count of even numbers: 0
    Count of even numbers: 1
    Count of even numbers: 0
    #+end_resultscode
   
** Actually collecting the numbers                                :B_onlyenv:
   :PROPERTIES:
   :BEAMER_env: onlyenv
   :BEAMER_act: <2>
   :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,autogobble=true,highlightlines={3}
    #+begin_src java :wrap resultscode :exports both
      int[] numbers = new int[]{1,2,3,4,5};
      int index = 0;
      int evens = 0;

      while(index < 5){
          if ( numbers[index] % 2 == 0 ){
              evens = evens + 1;
          }

          index = index + 1;    
      }
      System.out.println("Count of even numbers: " + evens);
    #+end_src

    #+RESULTS:
    #+begin_resultscode
    Count of even numbers: 2
    #+end_resultscode
